In [36]:
import pandas as pd

In [37]:
df = pd.read_csv("AcademicPerformance.csv")

In [38]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees
0,female,group B,bachelor's degree,standard,none,1970.0,72.0,72,74,6/16/14,"$84,835.00"
1,female,group C,some college,standard,completed,1961.0,NaN,na,A,6/15/14,"$57,091.00"
2,female,group B,master's degree,standard,none,1958.0,90.0,95,93,5/13/14,"$67,267.00"
3,male,group A,associate's degree,free/reduced,none,1967.0,NaN,NaN,44,05-11-2014,"$32,474.00"
4,male,group C,some college,standard,none,1989.0,76.0,78,75,04-08-2014,"$21,474.00"

In [49]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
Year_Birth                     0
math score                     0
reading score                  0
writing score                  0
Dt_Admission                   0
College_Fees                   0
dtype: int64

In [40]:
df['gender'].fillna(df['gender'].mode()[0] , inplace=True)

In [41]:
df['race/ethnicity'].fillna(df['race/ethnicity'].mode()[0] , inplace = True)

In [42]:
df['parental level of education'].fillna(df['parental level of education'].mode()[0] , inplace=True)

In [43]:
df['lunch'].fillna(df['lunch'].mode()[0] , inplace = True)

In [44]:
df['Dt_Admission'].fillna(df['Dt_Admission'].mode()[0] , inplace = True)

In [45]:
df['College_Fees'].fillna(df['College_Fees'].mode()[0] , inplace = True)

In [46]:
df['Year_Birth'].fillna(df['Year_Birth'].mode()[0] , inplace = True)

In [48]:
df[['math score', 'reading score', 'writing score']] = df[['math score', 'reading score', 'writing score']].apply(pd.to_numeric, errors='coerce')

# Drop rows with NaN values in the specified columns
df.dropna(subset=['math score', 'reading score', 'writing score'], inplace=True)

## Outliers

### Math Score

In [51]:
m_q1 = df['math score'].quantile(0.25)
m_q3 = df['math score'].quantile(0.75)

In [52]:
m_iqr = m_q3 - m_q1

In [53]:
lb = m_q1 - (1.5 * m_iqr)

In [55]:
ub = m_q3 + (1.5 * m_iqr)

In [56]:
outliers_math = df[ (df['math score'] < lb) | (df['math score'] > ub) ]

In [57]:
outliers_math

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees
17,female,group B,some high school,free/reduced,none,1958.0,18.0,32.0,28.0,08-01-2013,"$32,173.00"
59,female,group C,some high school,free/reduced,none,1964.0,0.0,17.0,10.0,01-01-2014,"$60,597.00"
145,female,group C,some college,free/reduced,none,1984.0,22.0,39.0,33.0,11-10-2012,"$18,890.00"
338,female,group B,some high school,free/reduced,none,1954.0,24.0,38.0,27.0,4/15/14,"$75,315.00"
466,female,group D,associate's degree,free/reduced,none,1954.0,26.0,31.0,38.0,02-12-2013,"$39,898.00"
787,female,group B,some college,standard,none,1972.0,19.0,38.0,32.0,11-03-2013,"$46,086.00"
842,female,group B,high school,free/reduced,completed,1972.0,23.0,44.0,36.0,05-03-2014,"$76,842.00"
980,female,group B,high school,free/reduced,none,1972.0,8.0,24.0,23.0,04-06-2013,"$72,504.00"

### Reading Score

In [59]:
r_q1 = df['reading score'].quantile(0.25)
r_q3 = df['reading score'].quantile(0.75)

In [60]:
r_iqr = r_q3 - r_q1

In [61]:
lb = r_q1 - (1.5 * r_iqr)
ub = r_q3 + (1.5 * r_iqr)

In [64]:
lb , ub

(29.0, 109.0)

In [62]:
outliers_reading = df[ (df['reading score'] < lb) | (df['reading score'] > ub)]

In [63]:
outliers_reading

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees
59,female,group C,some high school,free/reduced,none,1964.0,0.0,17.0,10.0,01-01-2014,"$60,597.00"
76,male,group E,some high school,standard,none,1963.0,30.0,26.0,22.0,09-07-2012,"$34,213.00"
211,male,group C,some college,free/reduced,none,1987.0,35.0,28.0,27.0,5/18/14,"$57,100.00"
327,male,group A,some college,free/reduced,none,1988.0,28.0,23.0,19.0,3/19/13,"$41,883.00"
596,male,group B,high school,free/reduced,none,1972.0,30.0,24.0,15.0,12/30/13,"$56,243.00"
980,female,group B,high school,free/reduced,none,1972.0,8.0,24.0,23.0,04-06-2013,"$72,504.00"